Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: فتقطعوا أمرهم بينهم زبرا كل حزب بما لديهم فرحون
en: But the people divided their religion among them into sects - each faction, in what it has, rejoicing.

source: فذرهم في غمرتهم حتى حين
en: So leave them in their confusion for a time.

source: أيحسبون أنما نمدهم به من مال وبنين
en: Do they think that what We extend to them of wealth and children

source: نسارع لهم في الخيرات بل لا يشعرون
en: Is [because] We hasten for them good things? Rather, they do not perceive.

source: إن الذين هم من خشية ربهم مشفقون
en: Indeed, they who are apprehensive from fear of their Lord

source: والذين هم بآيات ربهم يؤمنون
en: And they who believe in the signs of their Lord

source: والذين هم بربهم لا يشركون
en: And they who do not associate anything with their Lord

source: والذين يؤتون ما آتوا وقلوبهم وجلة أنهم إلى ربهم راجعون
en: And they who give what they give while their hearts are fearful because they will be returning to their Lord -

source: أولئك يسارعون في الخيرات وهم لها سابقون
en: It is those who hasten to good deeds, and they outstrip [others] therein.

source: ولا نكلف نفسا إلا وسعها ولدينا كتاب ينطق بالحق وهم لا يظلمون
en: And We charge no soul except [with that within] its capacity, and with Us is a record which speaks with truth; and they will not be wronged.

source: بل قلوبهم في غمرة من هذا ولهم أعمال من دون ذلك هم لها عاملون
en: But their hearts are covered with confusion over this, and they have [evil] deeds besides disbelief which they are doing,

source: حتى إذا أخذنا مترفيهم بالعذاب إذا هم يجأرون
en: Until when We seize their affluent ones with punishment, at once they are crying [to Allah] for help.

source: لا تجأروا اليوم إنكم منا لا تنصرون
en: Do not cry out today. Indeed, by Us you will not be helped.

source: قد كانت آياتي تتلى عليكم فكنتم على أعقابكم تنكصون
en: My verses had already been recited to you, but you were turning back on your heels

source: مستكبرين به سامرا تهجرون
en: In arrogance regarding it, conversing by night, speaking evil.

source: أفلم يدبروا القول أم جاءهم ما لم يأت آباءهم الأولين
en: Then have they not reflected over the Qur'an, or has there come to them that which had not come to their forefathers?

source: أم لم يعرفوا رسولهم فهم له منكرون
en: Or did they not know their Messenger, so they are toward him disacknowledging?

source: أم يقولون به جنة بل جاءهم بالحق وأكثرهم للحق كارهون
en: Or do they say, "In him is madness?" Rather, he brought them the truth, but most of them, to the truth, are averse.

source: ولو اتبع الحق أهواءهم لفسدت السماوات والأرض ومن فيهن بل أتيناهم بذكرهم فهم عن ذكرهم معرضون
en: But if the Truth had followed their inclinations, the heavens and the earth and whoever is in them would have been ruined. Rather, We have brought them their message, but they, from their message, are turning away.

source: أم تسألهم خرجا فخراج ربك خير وهو خير الرازقين
en: Or do you, [O Muhammad], ask them for payment? But the reward of your Lord is best, and He is the best of providers.

source: وإنك لتدعوهم إلى صراط مستقيم
en: And indeed, you invite them to a straight path.

source: وإن الذين لا يؤمنون بالآخرة عن الصراط لناكبون
en: But indeed, those who do not believe in the Hereafter are deviating from the path.

source: ولو رحمناهم وكشفنا ما بهم من ضر للجوا في طغيانهم يعمهون
en: And even if We gave them mercy and removed what was upon them of affliction, they would persist in their transgression, wandering blindly.

source: ولقد أخذناهم بالعذاب فما استكانوا لربهم وما يتضرعون
en: And We had gripped them with suffering [as a warning], but they did not yield to their Lord, nor did they humbly supplicate, [and will continue thus]

source: حتى إذا فتحنا عليهم بابا ذا عذاب شديد إذا هم فيه مبلسون
en: Until when We have opened before them a door of severe punishment, immediately they will be therein in despair.

source: وهو الذي أنشأ لكم السمع والأبصار والأفئدة قليلا ما تشكرون
en: And it is He who produced for you hearing and vision and hearts; little are you grateful.

source: وهو الذي ذرأكم في الأرض وإليه تحشرون
en: And it is He who has multiplied you throughout the earth, and to Him you will be gathered.

source: وهو الذي يحيي ويميت وله اختلاف الليل والنهار أفلا تعقلون
en: And it is He who gives life and causes death, and His is the alternation of the night and the day. Then will you not reason?

source: بل قالوا مثل ما قال الأولون
en: Rather, they say like what the former peoples said.

source: قالوا أإذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: They said, "When we have died and become dust and bones, are we indeed to be resurrected?

source: لقد وعدنا نحن وآباؤنا هذا من قبل إن هذا إلا أساطير الأولين
en: We have been promised this, we and our forefathers, before; this is not but legends of the former peoples."

source: قل لمن الأرض ومن فيها إن كنتم تعلمون
en: Say, [O Muhammad], "To whom belongs the earth and whoever is in it, if you should know?"

source: سيقولون لله قل أفلا تذكرون
en: They will say, "To Allah." Say, "Then will you not remember?"

source: قل من رب السماوات السبع ورب العرش العظيم
en: Say, "Who is Lord of the seven heavens and Lord of the Great Throne?"

source: سيقولون لله قل أفلا تتقون
en: They will say, "[They belong] to Allah." Say, "Then will you not fear Him?"

source: قل من بيده ملكوت كل شيء وهو يجير ولا يجار عليه إن كنتم تعلمون
en: Say, "In whose hand is the realm of all things - and He protects while none can protect against Him - if you should know?"

source: سيقولون لله قل فأنى تسحرون
en: They will say, "[All belongs] to Allah." Say, "Then how are you deluded?"

source: بل أتيناهم بالحق وإنهم لكاذبون
en: Rather, We have brought them the truth, and indeed they are liars.

source: ما اتخذ الله من ولد وما كان معه من إله إذا لذهب كل إله بما خلق ولعلا بعضهم على بعض سبحان الله عما يصفون
en: Allah has not taken any son, nor has there ever been with Him any deity. [If there had been], then each deity would have taken what it created, and some of them would have sought to overcome others. Exalted is Allah above what they describe [concerning Him].

source: عالم الغيب والشهادة فتعالى عما يشركون
en: [He is] Knower of the unseen and the witnessed, so high is He above what they associate [with Him].

source: قل رب إما تريني ما يوعدون
en: Say, [O Muhammad], "My Lord, if You should show me that which they are promised,

source: رب فلا تجعلني في القوم الظالمين
en: My Lord, then do not place me among the wrongdoing people."

source: وإنا على أن نريك ما نعدهم لقادرون
en: And indeed, We are able to show you what We have promised them.

source: ادفع بالتي هي أحسن السيئة نحن أعلم بما يصفون
en: Repel, by [means of] what is best, [their] evil. We are most knowing of what they describe.

source: وقل رب أعوذ بك من همزات الشياطين
en: And say, "My Lord, I seek refuge in You from the incitements of the devils,

source: وأعوذ بك رب أن يحضرون
en: And I seek refuge in You, my Lord, lest they be present with me."

source: حتى إذا جاء أحدهم الموت قال رب ارجعون
en: [For such is the state of the disbelievers], until, when death comes to one of them, he says, "My Lord, send me back

source: لعلي أعمل صالحا فيما تركت كلا إنها كلمة هو قائلها ومن ورائهم برزخ إلى يوم يبعثون
en: That I might do righteousness in that which I left behind." No! It is only a word he is saying; and behind them is a barrier until the Day they are resurrected.

source: فإذا نفخ في الصور فلا أنساب بينهم يومئذ ولا يتساءلون
en: So when the Horn is blown, no relationship will there be among them that Day, nor will they ask about one another.

source: فمن ثقلت موازينه فأولئك هم المفلحون
en: And those whose scales are heavy [with good deeds] - it is they who are the successful.

source: ومن خفت موازينه فأولئك الذين خسروا أنفسهم في جهنم خالدون
en: But those whose scales are light - those are the ones who have lost their souls, [being] in Hell, abiding eternally.

source: تلفح وجوههم النار وهم فيها كالحون
en: The Fire will sear their faces, and they therein will have taut smiles.

source: ألم تكن آياتي تتلى عليكم فكنتم بها تكذبون
en: [It will be said]. "Were not My verses recited to you and you used to deny them?"

source: قالوا ربنا غلبت علينا شقوتنا وكنا قوما ضالين
en: They will say, "Our Lord, our wretchedness overcame us, and we were a people astray.

source: ربنا أخرجنا منها فإن عدنا فإنا ظالمون
en: Our Lord, remove us from it, and if we were to return [to evil], we would indeed be wrongdoers."

source: قال اخسئوا فيها ولا تكلمون
en: He will say, "Remain despised therein and do not speak to Me.

source: إنه كان فريق من عبادي يقولون ربنا آمنا فاغفر لنا وارحمنا وأنت خير الراحمين
en: Indeed, there was a party of My servants who said, 'Our Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful.'

source: فاتخذتموهم سخريا حتى أنسوكم ذكري وكنتم منهم تضحكون
en: But you took them in mockery to the point that they made you forget My remembrance, and you used to laugh at them.

source: إني جزيتهم اليوم بما صبروا أنهم هم الفائزون
en: Indeed, I have rewarded them this Day for their patient endurance - that they are the attainers [of success]."

source: قال كم لبثتم في الأرض عدد سنين
en: [Allah] will say, "How long did you remain on earth in number of years?"

source: قالوا لبثنا يوما أو بعض يوم فاسأل العادين
en: They will say, "We remained a day or part of a day; ask those who enumerate."

source: قال إن لبثتم إلا قليلا لو أنكم كنتم تعلمون
en: He will say, "You stayed not but a little - if only you had known.

source: أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون
en: Then did you think that We created you uselessly and that to Us you would not be returned?"

source: فتعالى الله الملك الحق لا إله إلا هو رب العرش الكريم
en: So exalted is Allah, the Sovereign, the Truth; there is no deity except Him, Lord of the Noble Throne.

source: ومن يدع مع الله إلها آخر لا برهان له به فإنما حسابه عند ربه إنه لا يفلح الكافرون
en: And whoever invokes besides Allah another deity for which he has no proof - then his account is only with his Lord. Indeed, the disbelievers will not succeed.

source: وقل رب اغفر وارحم وأنت خير الراحمين
en: And, [O Muhammad], say, "My Lord, forgive and have mercy, and You are the best of the merciful."

source: سورة أنزلناها وفرضناها وأنزلنا فيها آيات بينات لعلكم تذكرون
en: [This is] a surah which We have sent down and made [that within it] obligatory and revealed therein verses of clear evidence that you might remember.

source: الزانية والزاني فاجلدوا كل واحد منهما مائة جلدة ولا تأخذكم بهما رأفة في دين الله إن كنتم تؤمنون بالله واليوم الآخر وليشهد عذابهما طائفة من المؤمنين
en: The [unmarried] woman or [unmarried] man found guilty of sexual intercourse - lash each one of them with a hundred lashes, and do not be taken by pity for them in the religion of Allah, if you should believe in Allah and the Last Day. And let a group of the believers witness their punishment.

source: الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك وحرم ذلك على المؤمنين
en: The fornicator does not marry except a [female] fornicator or polytheist, and none marries her except a fornicator or a polytheist, and that has been made unlawful to the believers.

source: والذين يرمون المحصنات ثم لم يأتوا بأربعة شهداء فاجلدوهم ثمانين جلدة ولا تقبلوا لهم شهادة أبدا وأولئك هم الفاسقون
en: And those who accuse chaste women and then do not produce four witnesses - lash them with eighty lashes and do not accept from them testimony ever after. And those are the defiantly disobedient,

source: والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم فشهادة أحدهم أربع شهادات بالله إنه لمن الصادقين
en: And those who accuse their wives [of adultery] and have no witnesses except themselves - then the witness of one of them [shall be] four testimonies [swearing] by Allah that indeed, he is of the truthful.

source: والخامسة أن لعنت الله عليه إن كان من الكاذبين
en: And the fifth [oath will be] that the curse of Allah be upon him if he should be among the liars.

source: ويدرأ عنها العذاب أن تشهد أربع شهادات بالله إنه لمن الكاذبين
en: But it will prevent punishment from her if she gives four testimonies [swearing] by Allah that indeed, he is of the liars.

source: والخامسة أن غضب الله عليها إن كان من الصادقين
en: And the fifth [oath will be] that the wrath of Allah be upon her if he was of the truthful.

source: ولولا فضل الله عليكم ورحمته وأن الله تواب حكيم
en: And if not for the favor of Allah upon you and His mercy... and because Allah is Accepting of repentance and Wise.

source: إن الذين جاءوا بالإفك عصبة منكم لا تحسبوه شرا لكم بل هو خير لكم لكل امرئ منهم ما اكتسب من الإثم والذي تولى كبره منهم له عذاب عظيم
en: Indeed, those who came with falsehood are a group among you. Do not think it bad for you; rather it is good for you. For every person among them is what [punishment] he has earned from the sin, and he who took upon himself the greater portion thereof - for him is a great punishment.

source: لولا إذ سمعتموه ظن المؤمنون والمؤمنات بأنفسهم خيرا وقالوا هذا إفك مبين
en: Why, when you heard it, did not the believing men and believing women think good of one another and say, "This is an obvious falsehood"?

source: لولا جاءوا عليه بأربعة شهداء فإذ لم يأتوا بالشهداء فأولئك عند الله هم الكاذبون
en: Why did they [who slandered] not produce for it four witnesses? And when they do not produce the witnesses, then it is they, in the sight of Allah, who are the liars.

source: ولولا فضل الله عليكم ورحمته في الدنيا والآخرة لمسكم في ما أفضتم فيه عذاب عظيم
en: And if it had not been for the favor of Allah upon you and His mercy in this world and the Hereafter, you would have been touched for that [lie] in which you were involved by a great punishment

source: إذ تلقونه بألسنتكم وتقولون بأفواهكم ما ليس لكم به علم وتحسبونه هينا وهو عند الله عظيم
en: When you received it with your tongues and said with your mouths that of which you had no knowledge and thought it was insignificant while it was, in the sight of Allah, tremendous.

source: ولولا إذ سمعتموه قلتم ما يكون لنا أن نتكلم بهذا سبحانك هذا بهتان عظيم
en: And why, when you heard it, did you not say, "It is not for us to speak of this. Exalted are You, [O Allah]; this is a great slander"?

source: يعظكم الله أن تعودوا لمثله أبدا إن كنتم مؤمنين
en: Allah warns you against returning to the likes of this [conduct], ever, if you should be believers.

source: ويبين الله لكم الآيات والله عليم حكيم
en: And Allah makes clear to you the verses, and Allah is Knowing and Wise.

source: إن الذين يحبون أن تشيع الفاحشة في الذين آمنوا لهم عذاب أليم في الدنيا والآخرة والله يعلم وأنتم لا تعلمون
en: Indeed, those who like that immorality should be spread [or publicized] among those who have believed will have a painful punishment in this world and the Hereafter. And Allah knows and you do not know.

source: ولولا فضل الله عليكم ورحمته وأن الله رءوف رحيم
en: And if it had not been for the favor of Allah upon you and His mercy... and because Allah is Kind and Merciful.

source: يا أيها الذين آمنوا لا تتبعوا خطوات الشيطان ومن يتبع خطوات الشيطان فإنه يأمر بالفحشاء والمنكر ولولا فضل الله عليكم ورحمته ما زكى منكم من أحد أبدا ولكن الله يزكي من يشاء والله سميع عليم
en: O you who have believed, do not follow the footsteps of Satan. And whoever follows the footsteps of Satan - indeed, he enjoins immorality and wrongdoing. And if not for the favor of Allah upon you and His mercy, not one of you would have been pure, ever, but Allah purifies whom He wills, and Allah is Hearing and Knowing.

source: ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى والمساكين والمهاجرين في سبيل الله وليعفوا وليصفحوا ألا تحبون أن يغفر الله لكم والله غفور رحيم
en: And let not those of virtue among you and wealth swear not to give [aid] to their relatives and the needy and the emigrants for the cause of Allah, and let them pardon and overlook. Would you not like that Allah should forgive you? And Allah is Forgiving and Merciful.

source: إن الذين يرمون المحصنات الغافلات المؤمنات لعنوا في الدنيا والآخرة ولهم عذاب عظيم
en: Indeed, those who [falsely] accuse chaste, unaware and believing women are cursed in this world and the Hereafter; and they will have a great punishment

source: يوم تشهد عليهم ألسنتهم وأيديهم وأرجلهم بما كانوا يعملون
en: On a Day when their tongues, their hands and their feet will bear witness against them as to what they used to do.

source: يومئذ يوفيهم الله دينهم الحق ويعلمون أن الله هو الحق المبين
en: That Day, Allah will pay them in full their deserved recompense, and they will know that it is Allah who is the perfect in justice.

source: الخبيثات للخبيثين والخبيثون للخبيثات والطيبات للطيبين والطيبون للطيبات أولئك مبرءون مما يقولون لهم مغفرة ورزق كريم
en: Evil words are for evil men, and evil men are [subjected] to evil words. And good words are for good men, and good men are [an object] of good words. Those [good people] are declared innocent of what the slanderers say. For them is forgiveness and noble provision.

source: يا أيها الذين آمنوا لا تدخلوا بيوتا غير بيوتكم حتى تستأنسوا وتسلموا على أهلها ذلكم خير لكم لعلكم تذكرون
en: O you who have believed, do not enter houses other than your own houses until you ascertain welcome and greet their inhabitants. That is best for you; perhaps you will be reminded.

source: فإن لم تجدوا فيها أحدا فلا تدخلوها حتى يؤذن لكم وإن قيل لكم ارجعوا فارجعوا هو أزكى لكم والله بما تعملون عليم
en: And if you do not find anyone therein, do not enter them until permission has been given you. And if it is said to you, "Go back," then go back; it is purer for you. And Allah is Knowing of what you do.

source: ليس عليكم جناح أن تدخلوا بيوتا غير مسكونة فيها متاع لكم والله يعلم ما تبدون وما تكتمون
en: There is no blame upon you for entering houses not inhabited in which there is convenience for you. And Allah knows what you reveal and what you conceal.

source: قل للمؤمنين يغضوا من أبصارهم ويحفظوا فروجهم ذلك أزكى لهم إن الله خبير بما يصنعون
en: Tell the believing men to reduce [some] of their vision and guard their private parts. That is purer for them. Indeed, Allah is Acquainted with what they do.

source: وقل للمؤمنات يغضضن من أبصارهن ويحفظن فروجهن ولا يبدين زينتهن إلا ما ظهر منها وليضربن بخمرهن على جيوبهن ولا يبدين زينتهن إلا لبعولتهن أو آبائهن أو آباء بعولتهن أو أبنائهن أو أبناء بعولتهن أو إخوانهن أو بني إخوانهن أو بني أخواتهن أو نسائهن أو ما ملكت أيمانهن أو التابعين غير أولي الإربة من الرجال أو الطفل الذين لم يظهروا على عورات النساء ولا يضربن بأرجلهن ليعلم ما يخفين من زينتهن وتوبوا إلى الله جميعا أيه المؤمنون لعلكم تفلحون
en: And tell the believing women to reduce [some] of their vision and guard their private parts and not expose their adornment except that which [necessarily] appears thereof and to wrap [a portion of] their headcovers over their chests and not expose their adornment except to their husbands, their fathers, their husbands' fathers, their sons, their husbands' sons, their brothers, their brothers' sons, their sisters' sons, their women, that which their right hands possess, or those male attendants having no physical desire, or children who are not yet aware of the private aspects of women. And let them not stamp their feet to make known what they conceal of their adornment. And turn to Allah in repentance, all of you, O believers, that you might succeed.

source: وأنكحوا الأيامى منكم والصالحين من عبادكم وإمائكم إن يكونوا فقراء يغنهم الله من فضله والله واسع عليم
en: And marry the unmarried among you and the righteous among your male slaves and female slaves. If they should be poor, Allah will enrich them from His bounty, and Allah is all-Encompassing and Knowing.

source: وليستعفف الذين لا يجدون نكاحا حتى يغنيهم الله من فضله والذين يبتغون الكتاب مما ملكت أيمانكم فكاتبوهم إن علمتم فيهم خيرا وآتوهم من مال الله الذي آتاكم ولا تكرهوا فتياتكم على البغاء إن أردن تحصنا لتبتغوا عرض الحياة الدنيا ومن يكرههن فإن الله من بعد إكراههن غفور رحيم
en: But let them who find not [the means for] marriage abstain [from sexual relations] until Allah enriches them from His bounty. And those who seek a contract [for eventual emancipation] from among whom your right hands possess - then make a contract with them if you know there is within them goodness and give them from the wealth of Allah which He has given you. And do not compel your slave girls to prostitution, if they desire chastity, to seek [thereby] the temporary interests of worldly life. And if someone should compel them, then indeed, Allah is [to them], after their compulsion, Forgiving and Merciful.

source: ولقد أنزلنا إليكم آيات مبينات ومثلا من الذين خلوا من قبلكم وموعظة للمتقين
en: And We have certainly sent down to you distinct verses and examples from those who passed on before you and an admonition for those who fear Allah.

source: الله نور السماوات والأرض مثل نوره كمشكاة فيها مصباح المصباح في زجاجة الزجاجة كأنها كوكب دري يوقد من شجرة مباركة زيتونة لا شرقية ولا غربية يكاد زيتها يضيء ولو لم تمسسه نار نور على نور يهدي الله لنوره من يشاء ويضرب الله الأمثال للناس والله بكل شيء عليم
en: Allah is the Light of the heavens and the earth. The example of His light is like a niche within which is a lamp, the lamp is within glass, the glass as if it were a pearly [white] star lit from [the oil of] a blessed olive tree, neither of the east nor of the west, whose oil would almost glow even if untouched by fire. Light upon light. Allah guides to His light whom He wills. And Allah presents examples for the people, and Allah is Knowing of all things.

source: في بيوت أذن الله أن ترفع ويذكر فيها اسمه يسبح له فيها بالغدو والآصال
en: [Such niches are] in mosques which Allah has ordered to be raised and that His name be mentioned therein; exalting Him within them in the morning and the evenings

source: رجال لا تلهيهم تجارة ولا بيع عن ذكر الله وإقام الصلاة وإيتاء الزكاة يخافون يوما تتقلب فيه القلوب والأبصار
en: [Are] men whom neither commerce nor sale distracts from the remembrance of Allah and performance of prayer and giving of zakah. They fear a Day in which the hearts and eyes will [fearfully] turn about -

source: ليجزيهم الله أحسن ما عملوا ويزيدهم من فضله والله يرزق من يشاء بغير حساب
en: That Allah may reward them [according to] the best of what they did and increase them from His bounty. And Allah gives provision to whom He wills without account.

source: والذين كفروا أعمالهم كسراب بقيعة يحسبه الظمآن ماء حتى إذا جاءه لم يجده شيئا ووجد الله عنده فوفاه حسابه والله سريع الحساب
en: But those who disbelieved - their deeds are like a mirage in a lowland which a thirsty one thinks is water until, when he comes to it, he finds it is nothing but finds Allah before Him, and He will pay him in full his due; and Allah is swift in account.

source: أو كظلمات في بحر لجي يغشاه موج من فوقه موج من فوقه سحاب ظلمات بعضها فوق بعض إذا أخرج يده لم يكد يراها ومن لم يجعل الله له نورا فما له من نور
en: Or [they are] like darknesses within an unfathomable sea which is covered by waves, upon which are waves, over which are clouds - darknesses, some of them upon others. When one puts out his hand [therein], he can hardly see it. And he to whom Allah has not granted light - for him there is no light.

source: ألم تر أن الله يسبح له من في السماوات والأرض والطير صافات كل قد علم صلاته وتسبيحه والله عليم بما يفعلون
en: Do you not see that Allah is exalted by whomever is within the heavens and the earth and [by] the birds with wings spread [in flight]? Each [of them] has known his [means of] prayer and exalting [Him], and Allah is Knowing of what they do.

source: ولله ملك السماوات والأرض وإلى الله المصير
en: And to Allah belongs the dominion of the heavens and the earth, and to Allah is the destination.
